Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/cdn-links_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: cdn-links title: CDN Links permalink: docs/cdn-links.html prev: create-a-new-react-app.html next: release-channels.html ---
ja: --- id: cdn-links title: CDN リンク permalink: docs/cdn-links.html prev: create-a-new-react-app.html next: release-channels.html ---

source: Both React and ReactDOM are available over a CDN.
ja: React および ReactDOM は CDN を介して利用することができます。

source: The versions above are only meant for development, and are not suitable for production.
ja: 上記のバージョンは開発のためだけのものであり、本番環境には適していません。

source: Minified and optimized production versions of React are available at:
ja: 圧縮・最適化された本番バージョンの React は下記のリンクから利用できます。

source: To load a specific version of `react` and `react-dom`, replace `17` with the version number.
ja: 特定のバージョンの `react` と `react-dom` をロードする場合は、`17` の部分をバージョン番号で置き換えてください。

source: ### Why the `crossorigin` Attribute?
ja: ### なぜ `crossorigin` 属性が必要なのか？

source: If you serve React from a CDN, we recommend to keep the [`crossorigin`](https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_settings_attributes) attribute set:
ja: CDN を使って React の機能を提供する場合、[`crossorigin`](https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_settings_attributes) 属性を設定することをお勧めします。

source: We also recommend to verify that the CDN you are using sets the `Access-Control-Allow-Origin: *` HTTP header:
ja: 利用している CDN が `Access-Control-Allow-Origin: *` という HTTP ヘッダを設定していることを確認することもお勧めします。

source: This enables a better [error handling experience](/blog/2017/07/26/error-handling-in-react-16.html) in React 16 and later.
ja: これにより React 16 以降でより優れた[エラーハンドリング](/blog/2017/07/26/error-handling-in-react-16.html)を利用できます。
